backend/app/controllers/favorites_controller.rb

    def create
        @favorite = Favorite.create(user_id: params[:user_id], favorite_id: params[:favorite_id], favorite_type: params[:favorite_type])
---
INSERT INTO "favorites" ("user_id", "favorite_id", "favorite_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 12], ["favorite_id", 2], ["favorite_type", "Restaurant"], ["created_at", "2019-09-09 22:30:45.217129"], ["updated_at", "2019-09-09 22:30:45.217129"]]