backend/app/controllers/users_controller.rb

    def create
    @user = User.new(
      name: params[:name],
      username: params[:username],
      bio: params[:bio],
      age: params[:age],
      city: params[:city]
    )
    if @user.save
---
INSERT INTO "users" ("name", "age", "city", "username", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "hao"], ["age", 12], ["city", "seattle"], ["username", "hao"], ["bio", "a"], ["created_at", "2019-09-09 21:30:36.136668"], ["updated_at", "2019-09-09 21:30:36.136668"]]